Repository: MiguelHKit/MostPopularArticlesNYT
Catalog: PruebaTecnicaRaven/Localizable.xcstrings
Source language: en
Languages: es

source: Advice
es: Aviso

# AlertRemoveAPIKeyMessage
source: Are you sure you want to remove API Key from Keychain?
es: ¿Estas seguro de borrar la API Key de la Keychain?

source: Articles
es: Articulos

# authorizationError
source: An authorization error ocurred
es: Ocurrió un error durante la autorización

# badResponse
source: Bad response from server
es: Mala respuesta del servidor

source: By day
es: Por día

source: By month
es: Por mes

source: By Week
es: por semana

source: Cancel
es: Cancelar

# dataError
source: There was an error during data conversion
es: Hubo un error al convertir de la información

# decodingError
source: There was an error when trying to decode
es: Hubo un error al decodificar

# encodingBodyError
source: There was an error when trying to encode data to be sent
es: Hubo un error al codificar la información a enviar

# errorTitle
source: An error has occurred
es: Ha ocurrido un error

# generalErrorMessage
source: An error has occurred. Please try again later
es: Ha ocurrido un error. inténtelo de nuevo más tarde

# invalidParameters
source: The given parameters are not valid
es: Los parámetros son inválidos

# invalidResponse
source: Response is invalid
es: La respuesta es invalida

# invalidURL
source: No valid URL
es: URL Invalida

# keychainInvalidData
source: Invalid data data for the Keychain
es: información invalida para el llavero

# keychainKeyNotFound
source: You need to enter an API key to perform the request. You can set it in the options menu at the top
es: Necesitas una API Key para realizar la petición. Puedes establecerla en Opciones del menu superior

# keychainKeyNotFoundTitle
source: No API Key
es: Sin API Key

# noData
source: Data not found
es: Sin Información

# noDataDescription
source: There are no articles to show here right now
es: No hay información de artículos para mostrar

source: Options
es: Opciones

source: Remove
es: Eliminar

source: Set
es: Establecer

source: Update
es: Actualizar

# urlDoesntExist
source: URL does not exist
es: No existe la URL

# validationError
source: There was an error during validation
es: Hubo un error durante la validación
